app/controllers/login_controller.rb

  def create
    # Crete a new login user with email valid params or alert user that params
    # are invalids.
    user = User.find_by_email(params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "rafaelsm.br@gmail.com"]]