app/controllers/projects_controller.rb

  def index
    # variable that receive all projects from search
    @projects = Project.all.search(params[:search])
    if current_user
      @myproject = current_user.projects.build # set project to current user project build
      logger.info "project setted"
    else
      @myproject = Project.all.search('nenhum')
---
SELECT "projects".* FROM "projects" WHERE (name LIKE '%nenhum%')
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 1]]

  def show
    #variable that receive params from view
    @codigourl = params[:id]
    #variable that receive first language on databse
    @language = Language.where(:id => @project.language_id).first
    #variable that receive first tool on db
    @tool = Tool.where(:id => @project.tool_id).first
    assert(@tool.kind_of?(Tool))
    @operationalsystem = OperationalSystem.where(
      :id => @project.operational_system_id).first
---
SELECT  "languages".* FROM "languages" WHERE "languages"."id" IS NULL  ORDER BY "languages"."id" ASC LIMIT 1
SELECT  "tools".* FROM "tools" WHERE "tools"."id" IS NULL  ORDER BY "tools"."id" ASC LIMIT 1
SELECT  "operational_systems".* FROM "operational_systems" WHERE "operational_systems"."id" IS NULL  ORDER BY "operational_systems"."id" ASC LIMIT 1

  def edit
    #get param id from view
    @codigourl = params[:id]
    @language = Language.where(:id => @project.language_id).first
    @tool = Tool.where(:id => @project.tool_id).first
    @operationalsystem = OperationalSystem.where(:id => @project.operational_system_id).first
---
SELECT  "languages".* FROM "languages" WHERE "languages"."id" IS NULL  ORDER BY "languages"."id" ASC LIMIT 1
SELECT  "tools".* FROM "tools" WHERE "tools"."id" IS NULL  ORDER BY "tools"."id" ASC LIMIT 1
SELECT  "operational_systems".* FROM "operational_systems" WHERE "operational_systems"."id" IS NULL  ORDER BY "operational_systems"."id" ASC LIMIT 1

  def create
    @project = current_user.projects.build(project_params)

    # If the flag pull of the openhug is on
    if params[:openhub_check]
      ohp = OpenHubProject.find_by_name(@project.name).first
      #variable that receive abot for a project
      @project.about = "#{ohp.description} <br>
                       <iframe src='https://www.openhub.net/p/#{ohp.vanity_url}
                       /widgets/project_factoids_stats'
                       scrolling='no' marginheight='0' marginwidth='0'
                       style='height: 220px; width: 370px; border: none'></iframe>"
      @project.image_url = ohp.medium_logo_url
      @project.link =  "OpenHub URL: <a href='#{ohp.html_url}'>#{ohp.html_url}</a><br>
                        Homepage Url: <a href='#{ohp.homepage_url}'>#{ohp.homepage_url}</a><br>
                        Download URL: <a href='#{ohp.download_url}'>#{ohp.download_url}</a>"
    else
      # nothing to do
    end
    #varriable with a url
    @project.image_url ||= 'assets/placeholder.png' # set project image is exists to a .png
    # if save pass  redirect to project if not render again new form
    if @project.save
---
INSERT INTO "projects" ("name", "description", "user_id", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "new"], ["description", "test"], ["user_id", 2], ["image_url", "assets/placeholder.png"], ["created_at", "2016-08-13 14:47:16.046666"], ["updated_at", "2016-08-13 14:47:16.046666"]]

    def set_project
      @project = Project.all.find(params[:id]) # set project to id project
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]