app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    assert(@user.kind_of(User))
    @user.photo_url ||= '/assets/avatar.jpeg'
    # if user saved set session and redirect if not render new form
    if @user.save
---
INSERT INTO "users" ("name", "email", "encrypted_password", "photo_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)